Repository: vasconcelosmomad/Twynk
Catalog: twynk_frontend/lib/l10n/app_*.arb
Languages: pt

# heroTitle
source: Each Nomirro can change your next date.
pt: Cada Nomirro pode mudar seu encontro.

# heroSubtitle
source: Discover real-life dates, have fun and connect with people who shine like you. Your next crush is here.
pt: Descubra encontros reais, divirta-se e conecte-se com pessoas que brilham como você. O seu próximo crush está aqui.

# heroCta
source: Download app
pt: Baixar app

# aboutTitle
source: About Nomirro
pt: Sobre o Nomirro

# aboutParagraph1
source: Nomirro is the new generation of dating apps — where connections happen in a light, fun and genuine way.
pt: O Nomirro é a nova geração dos apps de relacionamento onde as conexões acontecem de forma leve, divertida e verdadeira.

# aboutParagraph2
source: Inspired by real-life dates and authentic stories, Nomirro turns a simple match into moments that truly shine.
pt: Inspirado em encontros reais e histórias autênticas, o Nomirro transforma o simples match em momentos que brilham de verdade.

# aboutItem1Title
source: Real dates, no drama
pt: Encontros de verdade, sem complicações

# aboutItem1Body
source: Meet real people with honest intentions. In Nomirro, love happens naturally — without pressure, without judgment, in your own way.
pt: Conheça pessoas reais, com intenções sinceras. No Nomirro, o amor acontece naturalmente sem pressão, sem julgamentos, do seu jeito.

# aboutItem2Title
source: Find someone near you
pt: Encontre alguém perto de você

# aboutItem2Body
source: Fall in love with someone in your city, your neighbourhood or even on the other side of the world. With Nomirro, distance becomes an opportunity.
pt: Apaixone-se por quem está na sua cidade, no seu bairro ou até do outro lado do mundo. Com o Nomirro, a distância deixa de ser um obstáculo e vira uma oportunidade de conexão.

# aboutItem3Title
source: Talk by video or chat
pt: Converse por vídeo ou chat

# aboutItem3Body
source: Create real bonds with our modern and safe chat — with or without camera. See, smile and talk face to face with those who make your heart race.
pt: Crie laços reais com o nosso chat moderno e seguro com ou sem câmera. Veja, sorria e converse cara a cara com quem faz seu coração vibrar.

# aboutItem4Title
source: Balance and diversity
pt: Equilíbrio e diversidade

# aboutItem4Body
source: Nomirro is a space for everyone — open, inclusive and full of good vibes. Here, every connection is unique and respected.
pt: O Nomirro é um espaço para todos aberto, inclusivo e cheio de boas energias. Aqui, cada conexão é única e respeitada.

# aboutItem5Title
source: Where connections shine
pt: Onde as conexões brilham

# aboutItem5Body
source: More than a dating app, Nomirro is a place to be part of something special. Stories start with a click — and continue with sparkles in the eyes.
pt: Mais do que um app de namoro, o Nomirro é um lugar para fazer parte de algo especial. Histórias começam com um clique e continuam com brilho nos olhos.

# aboutPremiumBody
source: Unlimited messages, see who liked you and get highlighted in searches. Daily, Weekly and Monthly plans.
pt: Mensagens ilimitadas, ver quem curtiu você e destaque nas buscas. Planos Diário, Semanal e Mensal.

# navAbout
source: About
pt: Sobre

# navHowItWorks
source: How it works
pt: Como Funciona

# navFeatures
source: Features
pt: Recursos

# navSignUp
source: Sign up
pt: Registar-se

# howTitle
source: How it works
pt: Como Funciona

# howSubtitle
source: Getting started is easy. In just three steps you’ll be ready to find your next connection.
pt: Começar é fácil. Em apenas três passos, você estará pronto para encontrar sua conexão.

# howStep1Title
source: Create your profile
pt: Crie seu Perfil

# howStep1Body
source: Show your personality. Add your best photos and tell a bit about yourself.
pt: Mostre sua personalidade. Adicione suas melhores fotos e conte um pouco sobre você.

# howStep2Title
source: Swipe and match
pt: Deslize e Combine

# howStep2Body
source: Browse profiles and find interesting people. A swipe to the right can be the start of something new.
pt: Explore perfis e encontre pessoas interessantes. Um deslize para a direita pode ser o início de algo novo.

# howStep3Title
source: Start the conversation
pt: Inicie a Conversa

# howStep3Body
source: Got a match? Don’t wait! Send a message and start building a real connection.
pt: Deu match? Não espere! Envie uma mensagem e comece a construir uma conexão real.

# featuresTitle
source: Connections that happen
pt: Conexões que Acontecem

# featuresSubtitle
source: Nomirro was designed to be intuitive, safe and focused on your authenticity.
pt: O Nomirro foi projetado para ser intuitivo, seguro e focado na sua autenticidade.

# feature1Title
source: Instant chat
pt: Chat Instantâneo

# feature1Body
source: Don’t wait. Talk in real time and spark connections with text, audio and video messages.
pt: Não espere. Converse em tempo real e comece a faísca com mensagens de texto, áudio e vídeo.

# feature2Title
source: Authentic profiles
pt: Perfis Autênticos

# feature2Body
source: Photo verification and detailed interest filters to help you find exactly what you’re looking for.
pt: Verificação de fotos e filtros de interesse detalhados para garantir que você encontre o que procura.

# feature3Title
source: Safety first
pt: Segurança Primeiro

# feature3Body
source: Advanced reporting tools and 24/7 moderation to keep your experience safe and fun.
pt: Ferramentas avançadas de denúncia e moderação 24/7 para manter sua experiência segura e divertida.

# faqTitle
source: Frequently Asked Questions
pt: Perguntas Frequentes

# faqQ1Title
source: Why didn’t I receive the e-mail with my ID and password?
pt: Por que não recebi o e-mail com meu ID e senha?

# faqQ1Body
source: If you do not receive the registration e-mail within 10 minutes, check your spam or junk folder, as some providers may wrongly mark our messages. If you still can’t find it, try using another e-mail address (for example: Gmail, Yahoo, Outlook, etc.).
pt: Se você não receber o e-mail de registro em até 10 minutos, verifique sua pasta de spam ou lixo eletrônico, pois alguns provedores podem marcar nossas mensagens incorretamente. Se ainda assim não encontrar, tente usar outro endereço de e-mail (por exemplo: Gmail, Yahoo, Outlook, etc.).

# faqQ2Title
source: I forgot my password. How can I reset it?
pt: Esqueci minha senha. Como posso redefini-la?

# faqQ2Body
source: Go to: https://twynk.app/password Enter the e-mail used for registration and click on ‘Reset my password’. You will receive a link to create a new password.
pt: Acesse: https://twynk.app/password Digite o e-mail usado no cadastro e clique em ‘Redefinir minha senha’. Você receberá um link para criar uma nova senha.

# faqQ3Title
source: How long does it take for my photos to be approved? Why can’t I send a photo?
pt: Quanto tempo leva para minhas fotos serem aprovadas? Por que não consigo enviar uma foto?

# faqQ3Body
source: Approval may take a few hours, depending on the volume of uploads. If you are having trouble sending photos, check: Possible causes and solutions: - Unsupported format: use only JPEG or PNG. - Storage permissions (Android): Go to Settings → Apps → [Your browser or Nomirro app] → Permissions → Storage → Enable. - Outdated browser or app: Update Nomirro or try accessing it on another device.
pt: A aprovação pode levar até algumas horas, dependendo do volume de envios. Se estiver enfrentando problemas ao enviar fotos, verifique: Possíveis causas e soluções: - Formato não suportado: use apenas JPEG ou PNG. - Permissões de armazenamento (Android): Vá em Configurações → Aplicativos → [Seu navegador ou app Nomirro] → Permissões → Armazenamento → Ativar. - Navegador ou app desatualizado: Atualize o Nomirro ou tente acessar em outro dispositivo.

# faqQ4Title
source: How do I enable or disable e-mail notifications?
pt: Como ativar ou desativar as notificações por e-mail?

# faqQ4Body
source: Go to your profile → Settings → Notifications → choose your preferences to receive (or not) e-mails about new messages, likes and connections.
pt: Acesse seu perfil → Configurações → Notificações → escolha suas preferências para receber (ou não) e-mails sobre novas mensagens, curtidas e conexões.

# faqQ5Title
source: How can I delete my profile? I deleted my account by mistake. Can I reactivate it?
pt: Como posso excluir meu perfil? Excluí minha conta acidentalmente. Posso reativá-la?

# faqQ5Body
source: To delete your profile, go to Settings → Account → Delete profile and follow the instructions. If you deleted it by mistake, contact support within 7 days at: suporte@twynk.app — after this period, the account is permanently removed.
pt: Para excluir seu perfil, vá até Configurações → Conta → Excluir perfil e siga as instruções. Se você excluiu acidentalmente, entre em contato com o suporte antes de 7 dias pelo e-mail: suporte@twynk.app — após esse prazo, a conta é removida permanentemente.

# faqQ6Title
source: Can I send my e-mail or phone number in messages?
pt: Posso enviar meu e-mail ou número de telefone nas mensagens?

# faqQ6Body
source: You can, but Nomirro recommends that you only share personal information after you have built trust with the other person. Your safety and privacy come first.
pt: Você pode, mas o Nomirro recomenda que só compartilhe informações pessoais após criar confiança com a outra pessoa. Sua segurança e privacidade vêm em primeiro lugar.

# faqQ7Title
source: Is Nomirro free?
pt: O Nomirro é gratuito?

# faqQ7Body
source: Yes! Nomirro can be used for free to create an account, chat and meet new people. We also offer Nomirro Premium, with extra features like more visibility, unlimited requests and highlighted profile — but the basic usage will always remain free.
pt: Sim! O Nomirro pode ser usado gratuitamente para criar conta, conversar e conhecer novas pessoas. Além disso, já está disponível o Nomirro Premium, que oferece recursos extras como mais visibilidade, envio ilimitado de solicitações e destaque no app — mas o uso básico continuará totalmente gratuito.

# faqQ8Title
source: Any other questions?
pt: Outra dúvida?

# faqQ8Body
source: Contact Nomirro Support by e-mail: suporte@twynk.app or send a message via the Help menu inside the app.
pt: Entre em contato com o Suporte Nomirro pelo e-mail: suporte@twynk.app ou envie uma mensagem pelo menu Ajuda dentro do aplicativo.

# ctaTitle
source: Ready to Shine?
pt: Pronto para Brilhar?

# ctaSubtitle
source: Thousands of people are waiting to connect. Join the Nomirro community today!
pt: Milhares de pessoas estão esperando para se conectar. Junte-se à comunidade Nomirro hoje!

# footerTerms
source: Terms of Use
pt: Termos de Uso

# footerPrivacy
source: Privacy Policy
pt: Política de Privacidade

# footerCopyright
source: © 2025 Nomirro. All rights reserved.
pt: © 2025 Nomirro. Todos os direitos reservados.
